import phone1 from "../../images/phone1.png";
import phone2 from "../../images/phone2.png";
import phone3 from "../../images/phone3.png";
import image1 from "../../images/Image1.png";

function Details({ ProductDetails }) {
  return (
    <section className="border-1 border-secondary">
      {/* <p className="mt-4 mx-3">
        لقد تم تصميم هاتف ابل ايفون الذكي بهيكل ملفت وجميل يجعلك تحب النظر إليه
        في كل الأوقات. تعمل شاشة ليكويد رتينا 6.1 انش على جذب انتباهك وكل حواسك
        على عكس أي هاتف ذكي آخر. إن تصميم الزجاج والألومنيوم يجعلها متينًة وتضفي
        على الهاتف مظهرًا مثيرًا للحواس.
      </p>

      <div className="row">
        <div className="col-md-6 col-sm-12 mt-4">
          <img src={phone1} className="w-100 mx-2" alt="" />
        </div>
        <div className="col-md-6 col-sm-12 mt-4">
          <img src={phone2} className="w-100" alt="" />
        </div>
      </div>

      <div>
        <h2 className="mt-4 mx-3">للحظات لا تنسى</h2>
        <p className="mt-4 mx-3">
          يتميز هاتف ابل الذكي بإعداد كاميرا مزدوجة تبلغ دقتها 12 ميجابكسل تتيح
          لك التقاط أجمل الصور بتفاصيل خلابة ورائعة. سواء كانت مناظر طبيعية أو
          لحظات ثمينة لا تريد نسيانها أو كائنات سريعة الحركة؛ يمكنك التقاط صور
          لكل ذلك في أفضل الحالات باستخدام إعدادات الكاميرا المتطورة. قم بتصوير
          مقاطع الفيديو مثل المحترفين وإنشاء نقطة مرجعية لاسترجاع اللحظات
          المهمة. لن تؤثر ظروف الإضاءة المنخفضة على جودة صورتك، حيث توفر
          الكاميرا العريضة بدقة 12 ميجابكسل تركيزًا تلقائيًا أسرع بثلاث مرات في
          الإضاءة المنخفضة. مع الوضع الليلي، ليست هناك حاجة للفلاش بعد الآن، حيث
          يلتقط هذا الإعداد الصور بلون طبيعي وسطوع لا مثيل له. أعط الشيء الذي
          تريد تصويره الأضواء والتركيز الذي يستحقه مع وضع الصور الشخصية. تستفيد
          خاصية اتش دي ار الذكية من التعلم الآلي للتعرف على الأشخاص ومعاملتهم
          بطريقة مختلفة عن بقية اللقطة، مما توفر ميزات رائعة وظلال ولون بشرة
          طبيعية. التقط صور سيلفي رائعة مع كاميرا ترو ديبث بدقة تبلغ 12
          ميجابكسل. مع خاصية مثبت الصور البصري، لن يكون التقاط صور واضحة مشكلة
          بعد الآن.
        </p>
        <img src={image1} className="w-100 mt-4" alt="" />
        <p className="mt-4 mx-3">
          يضيف هاتف ايفون 11 الذكي سرعة فائقة إلى كل ما تفعله، من خلال شريحة ايه
          12 بيونيك التي تتميز بمحرك عصبي. تساعد هذه الشريحة القوية على تسهيل
          أداء المهام الكثيفة للقيام بها بطريقة سلسة. سواء كانت تقوم بتصوير
          فيديو بدقة 4 كيه بسرعة 60 إطارًا في الثانية في نطاق ديناميكي ممتد أو
          إعادة إلقاء الضوء على الشخص في مقدمة الصورة؛ تستطيع هذه الشريحة فعل كل
          هذا بسرعة مثيرة للإعجاب. بالإضافة إلى ذلك،
        </p>
      </div>

      <div className="row">
        <div className="col-md-4 col-sm-12">
          <img src={phone3} className="mx-5 w-75 h-100" alt="" />
        </div>

        <div className="col-md-8 sm-12">
          <h3 className="mx-3 mt-5">أداء سلس</h3>

          <p className="mt-5 mb-5 mx-3">
            يتميز هذا الهاتف الذكي من ابل بشاشة ليكويد رتينا يبلغ حجمها 6.1 انش
            تعمل بتقنية اتش دي وتوفر صورًا واضحة ومفصلة لتوصيل متعة الترفيه إلى
            المستوى الجديد بالكامل. شاهد أفلامك المفضلة أو الأحداث الرياضية
            المثيرة أو تصفح محتويات مختلفة على الإنترنت واستمتع بها على أكمل وجه
            بفضل الدمج الاستثنائي بين تقنية ترو تون ودولبي اتموس. يوفر هاتف ابل
            ايفون 11 صوراً بأعلى جودة ويجعلها تنبض بالحياة بفضل الدقة التي تبلغ
            1792 × 828 بكسل. تضمن الطبقة المضادة للزيوت ومقاومة لبصمات الأصابع
            عدم وجود علامات غير مرغوب فيها على الشاشة، حتى بعد الاستخدام المكثف.
            بالإضافة إلى ذلك، يحتوي هذا الهاتف الذكي على بطارية قوية تدوم طويلًا
            توفر ساعات من الترفيه غير المنقطع، مما يجعله شريك السفر المثالي.
          </p>

          <p className="mx-3">
            يحتوي هذا الهاتف من ايفون على ذاكرة وصول عشوائية تبلغ سعتها 4
            جيجابايت تجعل من تعدد المهام أسرع من أي وقت مضى؛ كما أنها تحمّل
            ألعاب الرسومية ذات المساحات الكبيرة وتطبيقات تحرير الفيديو بسرعة.
            يمكنك تخزين المزيد من محتويات الترفيه دون حذف أي من بياناتك أو صورك
            المخزنة سابقاً، وذلك بفضل سعة الذاكرة المدمجة التي يوفرها هذا الهاتف
            الذكي بسعة 128 جيجابايت. يتميز هاتف ابل ايفون 11 بنظام التشغيل اي او
            اس 13 الذي يجعل استخدامه فرحة لا مثيل لها. يضيف هذا النظام للتشغيل
            لمسة من الإثارة بميزات مثل الوضع المظلم على نطاق النظام وتسجيل
            الدخول باستخدام خيار ابل وواجهة جديدة لتحرير الصور.
          </p>
        </div>
      </div> */}
      <div
        dangerouslySetInnerHTML={{
          __html: ProductDetails?.productDetailDto[0]?.details_ar,
        }}
      />
    </section>
  );
}

export default Details;
